ERP.belugaerp/src/Catalogs/ОтветственныеЛицаОрганизаций/ОтветственныеЛицаОрганизаций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ОтветственныеЛицаОрганизаций</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <owners>Checked</owners>
  </extension>
  <owners>Catalog.Организации</owners>
  <attributes>
    <name>ОтветственноеЛицо</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ФизическоеЛицо</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
</mdclass:Catalog>

ERP.belugaerp/src/Catalogs/ОтветственныеЛицаОрганизаций/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

// Возвращает таблицу ответственного лица, сформированную в соответствии с отбором.
//
// Параметры:
//	ФизическоеЛицо - СправочникСсылка.ФизическиеЛица - 
//	Организация - СправочникСсылка.Организации -
//	Дата - Дата -
//
// Возвращаемое значение:
//	ТаблицаЗначений - Содержит колонки:
//		* Ссылка - СправочникСсылка.ОтветственныеЛицаОрганизаций - 
//		* ОтветственноеЛицо - ПеречислениеСсылка.ОтветственныеЛицаОрганизаций -
//		* Должность - Строка -
//		* ПравоПодписиПоДоверенности - Булево - 
//		* ОснованиеПраваПодписи - Строка -
//		* ДатаНачала - Дата -
//		* ДатаОкончания - Дата -
//		* ДокументПраваПодписи - Строка - 
//		* НомерДокументаПраваПодписи - Строка - 
//		* ДатаДокументаПраваПодписи - Дата -
//		
Функция бг_СведенияОбОтветственномЛицеПоФизЛицу(ФизическоеЛицо, Организация, Дата) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ОтветственныеЛицаОрганизаций.ИмяПредопределенныхДанных КАК ИмяПредопределенныхДанных,
	|	ОтветственныеЛицаОрганизаций.Предопределенный КАК Предопределенный,
	|	ОтветственныеЛицаОрганизаций.Ссылка КАК Ссылка,
	|	ОтветственныеЛицаОрганизаций.Наименование КАК Наименование,
	|	ОтветственныеЛицаОрганизаций.ОтветственноеЛицо КАК ОтветственноеЛицо,
	|	ОтветственныеЛицаОрганизаций.Должность КАК Должность,
	|	ОтветственныеЛицаОрганизаций.ПравоПодписиПоДоверенности КАК ПравоПодписиПоДоверенности,
	|	ОтветственныеЛицаОрганизаций.ОснованиеПраваПодписи КАК ОснованиеПраваПодписи,
	|	ОтветственныеЛицаОрганизаций.ДатаНачала КАК ДатаНачала,
	|	ОтветственныеЛицаОрганизаций.ДатаОкончания КАК ДатаОкончания,
	|	ОтветственныеЛицаОрганизаций.ДокументПраваПодписи КАК ДокументПраваПодписи,
	|	ОтветственныеЛицаОрганизаций.НомерДокументаПраваПодписи КАК НомерДокументаПраваПодписи,
	|	ОтветственныеЛицаОрганизаций.ДатаДокументаПраваПодписи КАК ДатаДокументаПраваПодписи,
	|	ОтветственныеЛицаОрганизаций.ДолжностьСсылка КАК ДолжностьСсылка
	|ИЗ
	|	Справочник.ОтветственныеЛицаОрганизаций КАК ОтветственныеЛицаОрганизаций
	|ГДЕ
	|	ОтветственныеЛицаОрганизаций.ДатаНачала <= &Дата
	|	И (ОтветственныеЛицаОрганизаций.ДатаОкончания >= &Дата
	|			ИЛИ ОтветственныеЛицаОрганизаций.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0))
	|	И ОтветственныеЛицаОрганизаций.ФизическоеЛицо = &ФизическоеЛицо
	|	И ОтветственныеЛицаОрганизаций.Владелец = &Организация
	|	И НЕ ОтветственныеЛицаОрганизаций.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("ФизическоеЛицо", ФизическоеЛицо);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

#КонецОбласти
